/*
中国象棋半张棋盘如图所示。马自左下角往右上角跳。规定只许往右跳，不许往左跳。
给出一个4*8大小的棋盘，起点坐标为(0,0)，终点目标未(8,4)
输出对应路线的打印格式 
*/ 
#include <iostream>
using namespace std;
int n=4,m=8;	//定义棋盘的行数为4，列数为8 
int a[100][10];	 //用于存储路劲中每一步所达到的坐标 
int i=1;
void dfs(int y,int x)
{
    if(y<0||y>n||x>m){	//判断是否超出棋盘边界 
    	return;
	}
    if(y==n&&x==m){		//判断是否到达终点 
    	for(int j=1;j<i;j++){	//若已到达终点则按顺序输出 
    		cout<<a[j][1]<<","<<a[j][2]<<"->";
		}
    	cout<<"4,8"<<endl;
	}
    else	//合法继续搜索 
    {
    	a[i][1]=y;		//将坐标位置进行赋值 
    	a[i][2]=x;
    	i++;
        dfs(y+2,x+1);	//往各个方向进行深度搜索 
        dfs(y+1,x+2);
        dfs(y-1,x+2);
        dfs(y-2,x+1);
        a[i][1]=0;		//进行回溯 
    	a[i][2]=0;
    	i--;
    }
}

int main()
{
    dfs(0, 0);
    return 0;
}



