/*
 这题与上一题一样是一个动态规划的大数问题，我们只要将其正确地分割为若干子问题即可 
  f[n] = *f[n-1] + 2*f[n-2] 
  
  如果考虑最后一列由1*2方块来竖着放，这样就是f[n-1], 
  接着我们考虑最后2*2的地方，有三种方式：一个2*2,二个1*2竖着,二个1*2横着,
  但是两个1*2竖着放置与第一部分的放置方法重复，所以我们得到第二个子问题为2*f[n-2]。 
  
*/

#include<iostream>
using namespace std;
//用于计算的函数 
void Pave(int n){
		int p,q;	 
		int s = 0;	//用于检测是否为第一个数 
		int a[1000][100]= {0};	//使用数组来解决大数问题 
		//起始状态 
		a[0][99] = 1;	
		a[1][99] = 3;
		a[2][99] = 5;
		int m;
		for(p = 3; p < n; p++){
			m = 2*a[p-2][99] + a[p-1][99];
			a[p][99] = m % 100000;
			for (q = 98; q >= 0; q--){
				m = 2*a[p - 2][q] + a[p - 1][q] + m / 100000; //计算第q位的五位数字（第q位的计算结果加上第五位的进位）
				a[p][q] = m % 100000;  //计算结果取余第五位存放在数组中
			}
			
		}
		
		for (int j = 0; j < 100; j++)   //循环输出
		{
			if (a[n - 1][j] != 0 && s == 0)  //第一个输出的不为0的数，不按照五位输出
			{
				cout << a[n - 1][j];
				s = 1;
			}
			else if (a[n - 1][j] != 0 && s == 1)   //其他按照五位固定输出
			{
				printf("%05d", a[n - 1][j]);
			}
		}
		cout << endl;
}
int main(){
	int n;
	cin>>n;
	Pave(n);
	return 0;
} 
